//15
let a;    

a = 10;    
alert('task 15 ' + a); 

a = 20;    
alert('task 15 ' + a); 

//17
let b = 1 + 2 + 3;
alert('task 17 ' + b); 

//18_1
let a1 = 10;
let b1 = 2;

alert('task 18 ' + a1+b1)
alert('task 18 ' + a1-b1)
alert('task 18 ' + a1*b1)
alert('task 18 ' + a1/b1)

//18_2
let c = 10;
let d = 5;
let result= c + d;

alert('task 18 ' + result)

//18_3
let a3 = 1;
let b3 = 2;
let c3 = 3;

alert('task 18 ' + a3+b3+c3)

//18_4
let a4 = 10;
let b4 = 5;
let c4 = a4 - b4;
let d4 = 7;
let result4 = c4 + d4;

alert('task 18 ' + result4);

// 19 
// let a = 5 + 5 * 3;
// alert(a);
// Результат выведния будет = 20

// let a = 5 + 5 * 3 + 3;
// alert(a);
// Результат выведния будет = 23

// let a = 8 / 2 + 2;
// alert(a);
// Результат выведния будет = 6

// let a = 8 + 2 / 2;
// alert(a);
// Результат выведния будет = 9

// 20 
// let a = 8 / 2 * 2;
// alert(a);
// Результат выведния будет = 8

// let a = 8 * 4 / 2 / 2
// alert(a);
// Результат выведния будет = 4

// 21
// let a = (2 + 3) * (2 + 3);
// alert(a);
// Результат выведния будет = 25

// let a = (2 + 3) * 2 + 3;
// alert(a);
// Результат выведния будет = 15

// let a = 2 * (2 + 4 * (3 + 1));
// alert(a);
// Результат выведния будет = 36

// let a = 2 * 8 / 4;
// alert(a);
// Результат выведния будет = 4

// let a = let a = (2 * 8) / 4;
// alert(a);
// Результат выведния будет = 4

//let a = 2 * (8 / 4);
// alert(a);
// Результат выведния будет = 4

// 22
let a22 = 1.5;
let b22 = 0.75;

alert('task 22 ' + a22+b22);

// 23
let a23_1 = -5;

alert('task 23 ' + a23_1);

let a23_2 = 50;

alert('task 23 ' + -a23_2);
 
// 25
// let a = 13;
// let b = 5;
//Остаток от деления 3

// 26
let a26 = 2;

alert('task 26 ' + a26 ** 10);

// 27
// let a = 3 * 2 ** 3;
// alert(a);
// Результат выведния будет = 24

// let a = (3 * 2) ** 3;
// alert(a);
// Результат выведния будет = 216

// let a = 3 * 2 ** (3 + 1);
// alert(a);
// Результат выведния будет = 48

// let a = 2 ** 3 * 3;
// alert(a);
// Результат выведния будет = 24

// let a = 3 * 2 ** 3 * 3;
// alert(a);
// Результат выведния будет = 72